In [127]:
import pandas as pd

# Population (race, sex, age)

## 1980

### data wrangling

In [128]:
pop = pd.read_csv(
    "../../data/pe-02.csv", skiprows=5, header=0
)  # first couple rows are informational text about csv
pop = pop.drop(0)  # first row empty
pop

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,854.0,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,882.0,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,133.0,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,147.0,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,2.0,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
188456,1989.0,56045.0,White female,227.0,308.0,268.0,226.0,140.0,205.0,289.0,...,209.0,187.0,165.0,162.0,153.0,148.0,120.0,86.0,63.0,52.0
188457,1989.0,56045.0,Black male,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
188458,1989.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
188459,1989.0,56045.0,Other races male,4.0,1.0,2.0,4.0,9.0,4.0,2.0,...,0.0,2.0,3.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0
188460,1989.0,56045.0,Other races female,3.0,5.0,4.0,4.0,4.0,5.0,6.0,...,2.0,7.0,6.0,3.0,1.0,0.0,0.0,1.0,0.0,0.0

In [129]:
pop_1980 = pop.query("`Year of Estimate` == 1980")
pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,854.0,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,882.0,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,133.0,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,147.0,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,2.0,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18842,1980.0,56045.0,White female,337.0,291.0,284.0,286.0,316.0,318.0,239.0,...,198.0,164.0,166.0,176.0,137.0,126.0,90.0,70.0,41.0,48.0
18843,1980.0,56045.0,Black male,0.0,0.0,0.0,1.0,2.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18844,1980.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18845,1980.0,56045.0,Other races male,4.0,6.0,8.0,5.0,8.0,4.0,3.0,...,2.0,2.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
18846,1980.0,56045.0,Other races female,8.0,8.0,7.0,4.0,6.0,6.0,3.0,...,3.0,5.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [130]:
# add total population column
cols_to_sum = list(pop_1980.columns)[3:]
pop_1980["Total Population"] = pop_1980[cols_to_sum].sum(axis=1)
pop_1980.head()

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_27336/3767407256.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pop_1980["Total Population"] = pop_1980[cols_to_sum].sum(axis=1)

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0,12394.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0,12482.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0,3383.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0,3810.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,48.0

In [131]:
# only include msas in BFI dataset
bfi_df = pd.read_csv("../../data/the_rise_of_healthcare_jobs_disclosed_data_by_msa.csv")
bfi_df.head()

,metro13,metro_title,change_ln_population,not_lbfr_share_prime_change,unemployed_share_prime_change,non_hc_share_prime_change,hc_emp_share_prime_change,manu_share_prime_change,non_manu_share_prime_change,manufacturing_share_prime1980,...,ln_aearn2022,change_earnings,college1980,college2022,change_college,healthcare_share_prime2022,healthcare_share_prime1980,change_non_hc_share_lbfr,change_ln_non_hc,non_hc_manu_share_prime_change
0,1,AL,0.006923,-0.01089,-0.01635,-0.020300,0.04754,-0.109100,0.13640,0.24990,...,10.61,0.4585,0.07756,0.1600,0.08243,0.08564,0.03810,-0.05360,0.01936,0.088800
1,5,AR,-0.027700,-0.02280,-0.01652,-0.009817,0.04915,-0.034590,0.07392,0.18920,...,10.61,0.4778,0.07879,0.1613,0.08254,0.08988,0.04074,-0.05038,0.02297,0.024760
2,6,CA,0.360200,-0.07647,-0.02523,0.080720,0.02098,-0.026890,0.12860,0.07481,...,10.89,0.5453,0.13910,0.2361,0.09704,0.06424,0.04326,-0.02911,0.38450,0.107610
3,8,CO,0.419600,-0.09702,-0.01325,0.087190,0.02308,0.008112,0.10220,0.03467,...,10.84,0.5516,0.15570,0.3569,0.20120,0.06779,0.04471,-0.02375,0.52890,0.079078
4,12,FL,0.463400,-0.05614,-0.00591,0.031780,0.03028,-0.065120,0.12720,0.09937,...,10.73,0.3837,0.14390,0.2902,0.14630,0.09054,0.06027,-0.03358,0.52410,0.096890

In [132]:
# map county to msa
msa_county = pd.read_csv("../../data/cbsatocountycrosswalk.csv", encoding="latin1")
msa_county

,countyname,state,ssacounty,fipscounty,cbsa,cbsaname,ssast,fipst
0,AUTAUGA,AL,1000,1001,33860.0,"Montgomery, AL",1,1
1,BALDWIN,AL,1010,1003,NaN,NaN,1,1
2,BARBOUR,AL,1020,1005,NaN,NaN,1,1
3,BIBB,AL,1030,1007,13820.0,"Birmingham-Hoover, AL",1,1
4,BLOUNT,AL,1040,1009,13820.0,"Birmingham-Hoover, AL",1,1
...,...,...,...,...,...,...,...,...
3268,VIEQUES,PR,40740,72147,NaN,NaN,40,72
3269,VILLALBA,PR,40750,72149,38660.0,"Ponce, PR",40,72
3270,YABUCOA,PR,40760,72151,41980.0,"San Juan-Caguas-Guaynabo, PR",40,72
3271,YAUCO,PR,40770,72153,49500.0,"Yauco, PR",40,72
3272,"PUERTO RICO, NFD",PR,40999,72990,NaN,NaN,40,72

In [133]:
# add msa codes to each county
msa_pop_1980 = pop_1980.merge(
    msa_county[["ssacounty", "fipscounty", "cbsaname"]],
    left_on="FIPS State and County Codes",
    right_on="fipscounty",
    how="inner",
).drop(columns=["fipscounty"])
msa_pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,ssacounty,cbsaname
0,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,524.0,428.0,358.0,242.0,123.0,52.0,39.0,12394.0,1000,"Montgomery, AL"
1,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,532.0,451.0,417.0,332.0,237.0,137.0,86.0,12482.0,1000,"Montgomery, AL"
2,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,113.0,126.0,128.0,87.0,70.0,31.0,13.0,3383.0,1000,"Montgomery, AL"
3,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,150.0,166.0,160.0,119.0,94.0,57.0,44.0,3810.0,1000,"Montgomery, AL"
4,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,1.0,0.0,1.0,0.0,0.0,0.0,0.0,48.0,1000,"Montgomery, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18805,1980.0,56045.0,White female,337.0,291.0,284.0,286.0,316.0,318.0,239.0,...,176.0,137.0,126.0,90.0,70.0,41.0,48.0,3499.0,53220,NaN
18806,1980.0,56045.0,Black male,0.0,0.0,0.0,1.0,2.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,5.0,53220,NaN
18807,1980.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,53220,NaN
18808,1980.0,56045.0,Other races male,4.0,6.0,8.0,5.0,8.0,4.0,3.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,44.0,53220,NaN
18809,1980.0,56045.0,Other races female,8.0,8.0,7.0,4.0,6.0,6.0,3.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,55.0,53220,NaN

In [134]:
# keep only rows relevant to bfi dataset
merged_pop_1980 = msa_pop_1980.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="ssacounty",
    right_on="metro13",
    how="inner",
).drop(columns=["ssacounty", "cbsaname"])
merged_pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,metro13,metro_title
0,1980.0,12085.0,White male,1336.0,1540.0,1761.0,2160.0,2095.0,1865.0,1799.0,...,1681.0,2225.0,2546.0,2243.0,1472.0,683.0,316.0,29192.0,10420,"Akron, OH"
1,1980.0,12085.0,White female,1291.0,1447.0,1652.0,1912.0,1816.0,1743.0,1735.0,...,2275.0,2786.0,2935.0,2472.0,1548.0,791.0,483.0,30568.0,10420,"Akron, OH"
2,1980.0,12085.0,Black male,244.0,259.0,277.0,270.0,234.0,175.0,155.0,...,87.0,88.0,71.0,47.0,43.0,16.0,8.0,2414.0,10420,"Akron, OH"
3,1980.0,12085.0,Black female,256.0,239.0,245.0,292.0,257.0,159.0,181.0,...,96.0,92.0,80.0,65.0,46.0,24.0,13.0,2496.0,10420,"Akron, OH"
4,1980.0,12085.0,Other races male,9.0,6.0,7.0,22.0,17.0,14.0,13.0,...,4.0,6.0,4.0,2.0,2.0,0.0,2.0,142.0,10420,"Akron, OH"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,1980.0,51069.0,White female,1181.0,1313.0,1508.0,1530.0,1333.0,1423.0,1508.0,...,820.0,642.0,517.0,398.0,266.0,154.0,150.0,16878.0,49340,"Worcester, MA-CT"
278,1980.0,51069.0,Black male,12.0,22.0,27.0,47.0,23.0,13.0,31.0,...,7.0,7.0,10.0,2.0,7.0,4.0,0.0,262.0,49340,"Worcester, MA-CT"
279,1980.0,51069.0,Black female,17.0,23.0,27.0,20.0,9.0,32.0,17.0,...,9.0,8.0,6.0,5.0,4.0,4.0,3.0,230.0,49340,"Worcester, MA-CT"
280,1980.0,51069.0,Other races male,4.0,1.0,4.0,3.0,3.0,1.0,4.0,...,0.0,0.0,1.0,1.0,0.0,0.0,0.0,32.0,49340,"Worcester, MA-CT"
281,1980.0,51069.0,Other races female,9.0,7.0,1.0,2.0,9.0,4.0,9.0,...,3.0,0.0,1.0,0.0,0.0,1.0,0.0,59.0,49340,"Worcester, MA-CT"

In [135]:
# table of total populations per msa
total_pop = merged_pop_1980.groupby(["metro13", "metro_title"], as_index=False)[
    "Total Population"
].sum()
total_pop.head()

   metro13                            metro_title  Total Population
0    10420                              Akron, OH           64964.0
1    10580            Albany-Schenectady-Troy, NY          182019.0
2    14460         Boston-Cambridge-Newton, MA-NH           33114.0
3    14860        Bridgeport-Stamford-Norwalk, CT            6117.0
4    15380  Buffalo-Cheektowaga-Niagara Falls, NY           30439.0

In [136]:
agg = merged_pop_1980.groupby(
    ["metro13", "metro_title", "Race/Sex Indicator"], as_index=False
)["Total Population"].sum()

for msa, group in agg.groupby("metro_title"):
    pivot = group.pivot_table(
        index="metro_title",
        columns="Race/Sex Indicator",
        values="Total Population",
        aggfunc="sum",
        fill_value=0,
    )

    total = pivot.sum(axis=1)
    proportions = pivot.div(total, axis=0)

    print(f"\n=== {msa} ===")
    print((proportions.T * 100).round(2))

=== Akron, OH ===
metro_title         Akron, OH
Race/Sex Indicator
Black female             3.84
Black male               3.72
Other races female       0.23
Other races male         0.22
White female            47.05
White male              44.94

=== Albany-Schenectady-Troy, NY ===
metro_title         Albany-Schenectady-Troy, NY
Race/Sex Indicator
Black female                               5.39
Black male                                 4.56
Other races female                         0.52
Other races male                           0.44
White female                              45.74
White male                                43.34

=== Boston-Cambridge-Newton, MA-NH ===
metro_title         Boston-Cambridge-Newton, MA-NH
Race/Sex Indicator
Black female                                  0.32
Black male                                    0.28
Other races female                            0.14
Other races male                              0.12
White female                                 50.87
White male                                   48.27

=== Bridgeport-Stamford-Norwalk, CT ===
metro_title         Bridgeport-Stamford-Norwalk, CT
Race/Sex Indicator
Black female                                   0.03
Black male                                     0.07
Other races female                             0.05
Other races male                               0.07
White female                                  50.20
White male                                    49.58

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
metro_title         Buffalo-Cheektowaga-Niagara Falls, NY
Race/Sex Indicator
Black female                                         0.61
Black male                                           0.69
Other races female                                   0.25
Other races male                                     0.20
White female                                        50.43
White male                                          47.81

=== Charleston-North Charleston, SC ===
metro_title         Charleston-North Charleston, SC
Race/Sex Indicator
Black female                                   0.01
Black male                                     0.01
Other races female                             0.05
Other races male                               0.05
White female                                  51.49
White male                                    48.39

=== Charlotte-Concord-Gastonia, NC-SC ===
metro_title         Charlotte-Concord-Gastonia, NC-SC
Race/Sex Indicator
Black female                                     0.04
Black male                                       0.15
Other races female                               0.18
Other races male                                 0.12
White female                                    50.38
White male                                      49.13

=== Chicago-Naperville-Elgin, IL-IN-WI ===
metro_title         Chicago-Naperville-Elgin, IL-IN-WI
Race/Sex Indicator
Black female                                      0.00
Black male                                        0.00
Other races female                                0.40
Other races male                                  0.23
White female                                     51.43
White male                                       47.94

=== Cincinnati, OH-KY-IN ===
metro_title         Cincinnati, OH-KY-IN
Race/Sex Indicator
Black female                        0.03
Black male                          0.11
Other races female                  0.08
Other races male                    0.10
White female                       53.10
White male                         46.57

=== Colorado Springs, CO ===
metro_title         Colorado Springs, CO
Race/Sex Indicator
Black female                        0.04
Black male                          0.00
Other races female                  0.13
Other races male                    0.09
White female                       50.73
White male                         49.00

=== Columbia, SC ===
metro_title         Columbia, SC
Race/Sex Indicator
Black female                0.17
Black male                  0.14
Other races female          0.31
Other races male            0.25
White female               49.88
White male                 49.25

=== Columbus, OH ===
metro_title         Columbus, OH
Race/Sex Indicator
Black female                0.28
Black male                  0.24
Other races female          0.14
Other races male            0.07
White female               49.67
White male                 49.59

=== Dallas-Fort Worth-Arlington, TX ===
metro_title         Dallas-Fort Worth-Arlington, TX
Race/Sex Indicator
Black female                                   9.81
Black male                                     8.48
Other races female                             0.07
Other races male                               0.07
White female                                  41.08
White male                                    40.49

=== Dayton, OH ===
metro_title         Dayton, OH
Race/Sex Indicator
Black female             22.17
Black male               19.34
Other races female        0.08
Other races male          0.07
White female             29.11
White male               29.24

=== Fresno, CA ===
metro_title         Fresno, CA
Race/Sex Indicator
Black female              9.10
Black male                7.47
Other races female        0.54
Other races male          0.27
White female             41.31
White male               41.31

=== Grand Rapids-Wyoming, MI ===
metro_title         Grand Rapids-Wyoming, MI
Race/Sex Indicator
Black female                            0.00
Black male                              0.00
Other races female                      0.13
Other races male                        0.06
White female                           49.81
White male                             50.00

=== Greensboro-High Point, NC ===
metro_title         Greensboro-High Point, NC
Race/Sex Indicator
Black female                             0.04
Black male                               0.02
Other races female                       0.21
Other races male                         0.15
White female                            50.84
White male                              48.74

=== Greenville-Anderson-Mauldin, SC ===
metro_title         Greenville-Anderson-Mauldin, SC
Race/Sex Indicator
Black female                                   0.00
Black male                                     0.00
Other races female                             0.56
Other races male                               0.40
White female                                  49.03
White male                                    50.01

=== Harrisburg-Carlisle, PA ===
metro_title         Harrisburg-Carlisle, PA
Race/Sex Indicator
Black female                          15.76
Black male                            14.14
Other races female                     0.08
Other races male                       0.05
White female                          35.82
White male                            34.15

=== Hartford-West Hartford-East Hartford, CT ===
metro_title         Hartford-West Hartford-East Hartford, CT
Race/Sex Indicator
Black female                                            7.94
Black male                                              6.89
Other races female                                      0.13
Other races male                                        0.16
White female                                           43.02
White male                                             41.85

=== Indianapolis-Carmel-Anderson, IN ===
metro_title         Indianapolis-Carmel-Anderson, IN
Race/Sex Indicator
Black female                                    0.02
Black male                                      0.06
Other races female                              0.21
Other races male                                0.22
White female                                   50.91
White male                                     48.58

=== Jacksonville, FL ===
metro_title         Jacksonville, FL
Race/Sex Indicator
Black female                    0.02
Black male                      0.02
Other races female              0.87
Other races male                0.80
White female                   48.58
White male                     49.71

=== Kansas City, MO-KS ===
metro_title         Kansas City, MO-KS
Race/Sex Indicator
Black female                      0.04
Black male                        0.02
Other races female                0.25
Other races male                  0.27
White female                     50.76
White male                       48.66

=== Milwaukee-Waukesha-West Allis, WI ===
metro_title         Milwaukee-Waukesha-West Allis, WI
Race/Sex Indicator
Black female                                     0.02
Black male                                       0.04
Other races female                               0.16
Other races male                                 0.13
White female                                    49.84
White male                                      49.80

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
metro_title         Nashville-Davidson--Murfreesboro--Franklin, TN
Race/Sex Indicator
Black female                                                  2.36
Black male                                                    2.40
Other races female                                            0.06
Other races male                                              0.06
White female                                                 48.61
White male                                                   46.51

=== New Haven-Milford, CT ===
metro_title         New Haven-Milford, CT
Race/Sex Indicator
Black female                         0.01
Black male                           0.00
Other races female                   6.23
Other races male                     5.95
White female                        43.17
White male                          44.64

=== New Orleans-Metairie, LA ===
metro_title         New Orleans-Metairie, LA
Race/Sex Indicator
Black female                            0.02
Black male                              0.03
Other races female                      0.69
Other races male                        0.77
White female                           47.51
White male                             50.99

=== Ogden-Clearfield, UT ===
metro_title         Ogden-Clearfield, UT
Race/Sex Indicator
Black female                        0.04
Black male                          0.07
Other races female                  0.16
Other races male                    0.15
White female                       50.80
White male                         48.78

=== Oklahoma City, OK ===
metro_title         Oklahoma City, OK
Race/Sex Indicator
Black female                     2.84
Black male                       2.66
Other races female               0.23
Other races male                 0.19
White female                    48.77
White male                      45.31

=== Omaha-Council Bluffs, NE-IA ===
metro_title         Omaha-Council Bluffs, NE-IA
Race/Sex Indicator
Black female                               0.45
Black male                                 0.42
Other races female                         0.12
Other races male                           0.13
White female                              50.16
White male                                48.71

=== Orlando-Kissimmee-Sanford, FL ===
metro_title         Orlando-Kissimmee-Sanford, FL
Race/Sex Indicator
Black female                                 0.87
Black male                                   1.96
Other races female                           0.17
Other races male                             0.15
White female                                50.27
White male                                  46.58

=== Oxnard-Thousand Oaks-Ventura, CA ===
metro_title         Oxnard-Thousand Oaks-Ventura, CA
Race/Sex Indicator
Black female                                    0.62
Black male                                      0.62
Other races female                             13.60
Other races male                               12.64
White female                                   37.35
White male                                     35.17

=== Palm Bay-Melbourne-Titusville, FL ===
metro_title         Palm Bay-Melbourne-Titusville, FL
Race/Sex Indicator
Black female                                     1.51
Black male                                       1.17
Other races female                               5.95
Other races male                                 5.66
White female                                    43.82
White male                                      41.88

=== Phoenix-Mesa-Scottsdale, AZ ===
metro_title         Phoenix-Mesa-Scottsdale, AZ
Race/Sex Indicator
Black female                               0.02
Black male                                 0.02
Other races female                         0.73
Other races male                           0.53
White female                              49.75
White male                                48.94

=== Pittsburgh, PA ===
metro_title         Pittsburgh, PA
Race/Sex Indicator
Black female                  0.14
Black male                    0.30
Other races female            0.69
Other races male              0.66
White female                 49.40
White male                   48.82

=== Provo-Orem, UT ===
metro_title         Provo-Orem, UT
Race/Sex Indicator
Black female                  0.10
Black male                    0.16
Other races female            0.22
Other races male              0.20
White female                 49.60
White male                   49.73

=== Raleigh, NC ===
metro_title         Raleigh, NC
Race/Sex Indicator
Black female               0.05
Black male                 0.08
Other races female         0.33
Other races male           0.28
White female              52.85
White male                46.41

=== Spokane-Spokane Valley, WA ===
metro_title         Spokane-Spokane Valley, WA
Race/Sex Indicator
Black female                              0.27
Black male                                0.22
Other races female                        0.14
Other races male                          0.10
White female                             51.68
White male                               47.59

=== Springfield, MA ===
metro_title         Springfield, MA
Race/Sex Indicator
Black female                   1.24
Black male                     1.07
Other races female             0.09
Other races male               0.07
White female                  49.92
White male                    47.61

=== Stockton-Lodi, CA ===
metro_title         Stockton-Lodi, CA
Race/Sex Indicator
Black female                     0.83
Black male                       0.81
Other races female               0.32
Other races male                 0.37
White female                    49.23
White male                      48.44

=== Syracuse, NY ===
metro_title         Syracuse, NY
Race/Sex Indicator
Black female                0.24
Black male                  0.26
Other races female          0.23
Other races male            0.23
White female               49.46
White male                 49.59

=== Tampa-St. Petersburg-Clearwater, FL ===
metro_title         Tampa-St. Petersburg-Clearwater, FL
Race/Sex Indicator
Black female                                       0.06
Black male                                         0.06
Other races female                                 0.59
Other races male                                   0.53
White female                                      51.44
White male                                        47.33

=== Toledo, OH ===
metro_title         Toledo, OH
Race/Sex Indicator
Black female              8.57
Black male                7.43
Other races female        0.31
Other races male          0.26
White female             42.91
White male               40.53

=== Tucson, AZ ===
metro_title         Tucson, AZ
Race/Sex Indicator
Black female              0.00
Black male                0.02
Other races female        1.38
Other races male          1.35
White female             47.80
White male               49.45

=== Tulsa, OK ===
metro_title         Tulsa, OK
Race/Sex Indicator
Black female             0.00
Black male               0.00
Other races female       0.57
Other races male         0.41
White female            49.05
White male              49.98

=== Winston-Salem, NC ===
metro_title         Winston-Salem, NC
Race/Sex Indicator
Black female                    36.10
Black male                      34.35
Other races female               4.19
Other races male                 4.13
White female                     9.85
White male                      11.38

=== Worcester, MA-CT ===
metro_title         Worcester, MA-CT
Race/Sex Indicator
Black female                    0.67
Black male                      0.76
Other races female              0.17
Other races male                0.09
White female                   49.05
White male                     49.25

In [137]:
msa_tables_1980 = {}

cats = [
    "White male",
    "Black male",
    "Other races male",
    "White female",
    "Black female",
    "Other races female",
]

agg = merged_pop_1980.groupby(["metro_title", "Race/Sex Indicator"], as_index=False)[
    "Total Population"
].sum()

for msa, g in agg.groupby("metro_title", sort=True):
    p = g.pivot_table(
        index="Race/Sex Indicator",
        values="Total Population",
        aggfunc="sum",
        fill_value=0,
    ).reindex(cats)

    # male totals & shares
    male_total = p.loc[["White male", "Black male", "Other races male"]].sum().item()
    male_white = 0 if male_total == 0 else p.loc["White male"].item() / male_total * 100
    male_black = 0 if male_total == 0 else p.loc["Black male"].item() / male_total * 100
    male_other = (
        0 if male_total == 0 else p.loc["Other races male"].item() / male_total * 100
    )

    # female totals & shares
    female_total = (
        p.loc[["White female", "Black female", "Other races female"]].sum().item()
    )
    female_white = (
        0 if female_total == 0 else p.loc["White female"].item() / female_total * 100
    )
    female_black = (
        0 if female_total == 0 else p.loc["Black female"].item() / female_total * 100
    )
    female_other = (
        0
        if female_total == 0
        else p.loc["Other races female"].item() / female_total * 100
    )

    proportions = pd.DataFrame(
        {
            "White": [male_white, female_white],
            "Black": [male_black, female_black],
            "Other": [male_other, female_other],
        },
        index=["Male", "Female"],
    ).round(2)

    msa_tables_1980[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    91.95   7.60   0.45
Female  92.03   7.51   0.46

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    89.65   9.44   0.91
Female  88.56  10.44   1.00

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    99.17   0.58   0.25
Female  99.11   0.63   0.26

=== Bridgeport-Stamford-Norwalk, CT ===
        White  Black  Other
Male    99.74   0.13   0.13
Female  99.84   0.07   0.10

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    98.17   1.42   0.41
Female  98.32   1.20   0.49

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    99.88   0.02    0.1
Female  99.89   0.01    0.1

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    99.45   0.29   0.25
Female  99.56   0.08   0.36

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    99.52    0.0   0.48
Female  99.23    0.0   0.77

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    99.54   0.24   0.22
Female  99.79   0.06   0.15

=== Colorado Springs, CO ===
        White  Black  Other
Male    99.82   0.00   0.18
Female  99.65   0.09   0.26

=== Columbia, SC ===
        White  Black  Other
Male    99.22   0.29   0.50
Female  99.05   0.33   0.62

=== Columbus, OH ===
        White  Black  Other
Male    99.36   0.49   0.15
Female  99.16   0.55   0.28

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    82.57  17.30   0.13
Female  80.62  19.26   0.13

=== Dayton, OH ===
        White  Black  Other
Male    60.11  39.76   0.14
Female  56.67  43.17   0.15

=== Fresno, CA ===
        White  Black  Other
Male    84.21  15.24   0.55
Female  81.08  17.86   1.06

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    99.88    0.0   0.12
Female  99.73    0.0   0.27

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    99.66   0.04   0.31
Female  99.51   0.07   0.42

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    99.21    0.0   0.79
Female  98.86    0.0   1.14

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    70.64  29.25   0.11
Female  69.35  30.50   0.15

=== Hartford-West Hartford-East Hartford, CT ===
        White  Black  Other
Male    85.58  14.10   0.32
Female  84.19  15.55   0.26

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    99.44   0.11   0.44
Female  99.55   0.05   0.41

=== Jacksonville, FL ===
        White  Black  Other
Male    98.38   0.04   1.58
Female  98.20   0.03   1.76

=== Kansas City, MO-KS ===
        White  Black  Other
Male    99.40   0.04   0.56
Female  99.42   0.08   0.49

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    99.65   0.09   0.26
Female  99.64   0.03   0.33

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    94.98   4.90   0.12
Female  95.26   4.63   0.12

=== New Haven-Milford, CT ===
        White  Black  Other
Male    88.23   0.00  11.77
Female  87.37   0.03  12.60

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    98.46   0.05   1.49
Female  98.53   0.04   1.42

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    99.54   0.15   0.31
Female  99.62   0.07   0.31

=== Oklahoma City, OK ===
        White  Black  Other
Male    94.08   5.52   0.40
Female  94.08   5.48   0.45

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    98.87   0.86   0.27
Female  98.87   0.88   0.24

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    95.66   4.02   0.32
Female  97.97   1.69   0.34

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    72.61   1.28  26.11
Female  72.42   1.21  26.37

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    85.97   2.41  11.62
Female  85.45   2.95  11.60

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    98.87   0.05   1.08
Female  98.52   0.03   1.45

=== Pittsburgh, PA ===
        White  Black  Other
Male    98.08   0.59   1.33
Female  98.36   0.27   1.37

=== Provo-Orem, UT ===
        White  Black  Other
Male    99.29   0.31   0.39
Female  99.37   0.20   0.43

=== Raleigh, NC ===
        White  Black  Other
Male    99.23   0.18   0.59
Female  99.28   0.09   0.63

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    99.33   0.46   0.21
Female  99.22   0.51   0.27

=== Springfield, MA ===
        White  Black  Other
Male    97.65   2.20   0.15
Female  97.40   2.42   0.18

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    97.63   1.63   0.74
Female  97.72   1.65   0.63

=== Syracuse, NY ===
        White  Black  Other
Male    99.03   0.52   0.45
Female  99.07   0.48   0.45

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    98.77   0.13   1.10
Female  98.75   0.12   1.13

=== Toledo, OH ===
        White  Black  Other
Male    84.05  15.40   0.54
Female  82.85  16.54   0.61

=== Tucson, AZ ===
        White  Black  Other
Male    97.31   0.03   2.66
Female  97.19   0.00   2.81

=== Tulsa, OK ===
        White  Black  Other
Male    99.19    0.0   0.81
Female  98.85    0.0   1.15

=== Winston-Salem, NC ===
        White  Black  Other
Male    22.82  68.91   8.28
Female  19.65  72.00   8.35

=== Worcester, MA-CT ===
        White  Black  Other
Male    98.29   1.52   0.19
Female  98.32   1.34   0.34

## 2022

### data wrangling

codebook: https://www2.census.gov/programs-surveys/popest/technical-documentation/file-layouts/2020-2023/CBSA-EST2023-ALLDATA-CHAR.pdf

In [138]:
pop2 = pd.read_csv("../../data/cbsa-est2023-alldata-char.csv", encoding="latin1").drop(
    columns=["MDIV", "LSAD", "SUMLEV"]
)
pop2 = pop2.query(
    "`YEAR` == 4"
)  # 1 = 4/1/2020 population estimates, 2 = 7/1/2020, 3 = 7/1/2021, 4 = 7/1/2022, 5 = 7/1/2023
pop2 = pop2.drop(columns=["YEAR"])
pop2

,CBSA,NAME,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,WA_MALE,WA_FEMALE,BA_MALE,BA_FEMALE,...,HWAC_MALE,HWAC_FEMALE,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE
57,10180,"Abilene, TX",0,179665,91450,88215,76766,76213,9412,6473,...,20990,19398,1229,1104,852,769,341,234,132,105
58,10180,"Abilene, TX",1,11307,5862,5445,4713,4344,668,631,...,1724,1524,151,163,53,40,20,20,9,13
59,10180,"Abilene, TX",2,11934,5980,5954,4944,4920,524,527,...,1667,1790,146,143,60,71,34,29,9,3
60,10180,"Abilene, TX",3,11716,5951,5765,4930,4750,568,526,...,1797,1717,118,134,63,69,31,32,11,14
61,10180,"Abilene, TX",4,13387,6902,6485,5775,5459,653,591,...,1946,1817,120,137,57,73,26,35,13,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
91366,49820,"Zapata, TX",14,525,261,264,251,261,4,0,...,227,235,2,0,2,0,0,0,0,0
91367,49820,"Zapata, TX",15,506,226,280,221,271,2,1,...,178,234,1,0,2,2,0,0,0,0
91368,49820,"Zapata, TX",16,366,171,195,169,190,1,0,...,137,172,0,0,0,1,0,0,0,0
91369,49820,"Zapata, TX",17,279,146,133,143,131,1,0,...,125,105,0,0,2,0,0,1,0,0
91370,49820,"Zapata, TX",18,171,83,88,80,84,1,1,...,47,54,0,0,0,0,0,0,0,0

In [139]:
# keep only rows relevant to bfi dataset
merged_pop_2022 = pop2.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="CBSA",
    right_on="metro13",
    how="inner",
).drop(columns=["CBSA", "NAME"])
merged_pop_2022

,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,WA_MALE,WA_FEMALE,BA_MALE,BA_FEMALE,IA_MALE,IA_FEMALE,...,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE,metro13,metro_title
0,0,697511,340470,357041,274240,283462,42224,48769,689,791,...,1243,1385,351,428,214,209,106,96,10420,"Akron, OH"
1,1,35331,17932,17399,12431,11813,3124,3249,24,39,...,150,170,34,51,30,27,8,10,10420,"Akron, OH"
2,2,38893,19771,19122,13812,13103,3488,3493,38,41,...,175,197,36,43,42,19,20,15,10420,"Akron, OH"
3,3,40363,20575,19788,14756,14131,3553,3440,33,28,...,165,139,33,24,17,24,18,12,10420,"Akron, OH"
4,4,43776,21969,21807,16630,16243,3318,3447,37,52,...,116,147,34,47,14,25,11,12,10420,"Akron, OH"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2503,14,50333,24611,25722,22730,23687,900,909,93,104,...,176,193,73,69,14,14,6,6,49340,"Worcester, MA-CT"
2504,15,38465,18272,20193,17106,18766,519,591,51,39,...,81,125,36,15,3,5,1,7,49340,"Worcester, MA-CT"
2505,16,26576,12204,14372,11535,13457,272,356,38,28,...,58,85,16,18,6,5,2,2,49340,"Worcester, MA-CT"
2506,17,15848,6558,9290,6195,8668,95,217,18,26,...,33,35,8,18,3,4,2,1,49340,"Worcester, MA-CT"
2507,18,15892,5380,10512,5051,10060,95,143,22,42,...,16,40,4,22,0,6,1,3,49340,"Worcester, MA-CT"

In [140]:
# organize to look lik 1980 data
min_df_2022 = merged_pop_2022[
    [
        "metro13",
        "metro_title",
        "TOT_POP",
        "TOT_MALE",
        "TOT_FEMALE",
        "WAC_MALE",
        "WAC_FEMALE",
        "BAC_MALE",
        "BAC_FEMALE",
    ]
]
min_df_2022["OTHER_MALE"] = merged_pop_2022[["IAC_MALE", "AAC_MALE", "NAC_MALE"]].sum(
    axis=1
)
min_df_2022["OTHER_FEMALE"] = merged_pop_2022[
    ["IAC_FEMALE", "AAC_FEMALE", "NAC_FEMALE"]
].sum(axis=1)
min_df_2022

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_27336/2039280576.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  min_df_2022["OTHER_MALE"] = merged_pop_2022[["IAC_MALE", "AAC_MALE", "NAC_MALE"]].sum(
/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_27336/2039280576.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  min_df_2022["OTHER_FEMALE"] = merged_pop_2022[

,metro13,metro_title,TOT_POP,TOT_MALE,TOT_FEMALE,WAC_MALE,WAC_FEMALE,BAC_MALE,BAC_FEMALE,OTHER_MALE,OTHER_FEMALE
0,10420,"Akron, OH",697511,340470,357041,283032,292666,48263,55181,19252,19862
1,10420,"Akron, OH",35331,17932,17399,13683,13046,4116,4229,1518,1489
2,10420,"Akron, OH",38893,19771,19122,15037,14295,4434,4408,1654,1728
3,10420,"Akron, OH",40363,20575,19788,15942,15372,4460,4390,1484,1407
4,10420,"Akron, OH",43776,21969,21807,17708,17349,4143,4278,1324,1419
...,...,...,...,...,...,...,...,...,...,...,...
2503,49340,"Worcester, MA-CT",50333,24611,25722,22902,23847,986,991,942,1094
2504,49340,"Worcester, MA-CT",38465,18272,20193,17197,18852,549,628,636,820
2505,49340,"Worcester, MA-CT",26576,12204,14372,11585,13522,291,386,389,543
2506,49340,"Worcester, MA-CT",15848,6558,9290,6233,8713,112,233,263,401
2507,49340,"Worcester, MA-CT",15892,5380,10512,5054,10109,96,166,234,298

In [141]:
msa_tables_2022 = {}

agg_cols = [
    "TOT_POP",
    "TOT_MALE",
    "TOT_FEMALE",
    "WAC_MALE",
    "BAC_MALE",
    "OTHER_MALE",
    "WAC_FEMALE",
    "BAC_FEMALE",
    "OTHER_FEMALE",
]
msa_totals = min_df_2022.groupby("metro_title", as_index=False)[agg_cols].sum()

# male race shares within each MSA
male_props = msa_totals[
    ["metro_title", "WAC_MALE", "BAC_MALE", "OTHER_MALE", "TOT_MALE"]
].copy()
male_props[["White", "Black", "Other"]] = male_props[
    ["WAC_MALE", "BAC_MALE", "OTHER_MALE"]
].div(male_props["TOT_MALE"], axis=0)
male_props = male_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)

# female race shares within each MSA
female_props = msa_totals[
    ["metro_title", "WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE", "TOT_FEMALE"]
].copy()
female_props[["White", "Black", "Other"]] = female_props[
    ["WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE"]
].div(female_props["TOT_FEMALE"], axis=0)
female_props = female_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)


for msa in msa_totals["metro_title"]:
    male_row = male_props.loc[
        male_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()
    female_row = female_props.loc[
        female_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()

    proportions = pd.DataFrame(
        [male_row.to_numpy(), female_row.to_numpy()],
        index=["Male", "Female"],
        columns=["White", "Black", "Other"],
    ).astype(float)
    proportions = (proportions * 100).round(2)
    msa_tables_2022[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    83.13  14.18   5.65
Female  81.97  15.46   5.56

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    84.71  11.23   7.25
Female  84.41  11.49   7.17

=== Albuquerque, NM ===
        White  Black  Other
Male    85.32   5.02  13.43
Female  85.10   4.35  14.21

=== Allentown-Bethlehem-Easton, PA-NJ ===
        White  Black  Other
Male    86.45  10.61   5.72
Female  86.86  10.41   5.61

=== Atlanta-Sandy Springs-Roswell, GA ===
        White  Black  Other
Male    57.57  35.99   9.22
Female  54.60  39.23   9.06

=== Augusta-Richmond County, GA-SC ===
        White  Black  Other
Male    61.19  37.35   4.55
Female  58.56  39.73   4.78

=== Austin-Round Rock, TX ===
        White  Black  Other
Male    82.29   9.49  11.35
Female  82.36   9.50  11.29

=== Bakersfield, CA ===
        White  Black  Other
Male    84.61   7.56  11.46
Female  84.63   7.24  11.90

=== Baltimore-Columbia-Towson, MD ===
        White  Black  Other
Male    63.70  30.75   8.93
Female  60.83  33.67   8.89

=== Baton Rouge, LA ===
        White  Black  Other
Male    61.88  36.04   3.78
Female  59.94  38.14   3.71

=== Birmingham-Hoover, AL ===
        White  Black  Other
Male    69.55  28.99    3.1
Female  67.31  31.18    3.1

=== Boise City, ID ===
        White  Black  Other
Male    94.85   2.18   6.42
Female  94.82   1.82   6.71

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    80.17  11.39  11.48
Female  79.78  11.49  11.65

=== Bridgeport-Stamford-Norwalk, CT ===
        White  Black  Other
Male    80.43  14.15   8.01
Female  79.16  15.24   8.17

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    82.55  13.63   6.44
Female  81.39  14.85   6.33

=== Cape Coral-Fort Myers, FL ===
        White  Black  Other
Male    88.22  10.34   3.45
Female  87.96  10.34   3.67

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    73.18  24.98   4.63
Female  71.03  27.01   4.68

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    71.13  24.42   7.12
Female  69.17  26.70   6.85

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    75.46  17.02   9.93
Female  73.09  19.21  10.06

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    83.61  14.10   4.92
Female  82.89  14.94   4.80

=== Colorado Springs, CO ===
        White  Black  Other
Male    87.80   9.54   8.55
Female  87.73   8.64   9.52

=== Columbia, SC ===
        White  Black  Other
Male    62.82  35.06   4.73
Female  60.19  37.89   4.53

=== Columbus, OH ===
        White  Black  Other
Male    77.05  19.01   7.35
Female  76.56  19.45   7.41

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    73.51  17.89  11.30
Female  71.89  19.62  11.22

=== Deltona-Daytona Beach-Ormond Beach, FL ===
        White  Black  Other
Male    85.60  12.94   4.17
Female  85.15  13.23   4.32

=== Denver-Aurora-Lakewood, CO ===
        White  Black  Other
Male    86.73   8.02   9.04
Female  86.51   7.64   9.75

=== Des Moines-West Des Moines, IA ===
        White  Black  Other
Male    88.42   7.86   6.28
Female  89.18   7.05   6.26

=== Detroit-Warren-Dearborn, MI ===
        White  Black  Other
Male    73.02  22.46   7.43
Female  70.54  25.21   7.15

=== El Paso, TX ===
        White  Black  Other
Male    91.96   5.84   4.11
Female  93.27   4.47   4.04

=== Fayetteville-Springdale-Rogers, AR-MO ===
        White  Black  Other
Male    88.88   4.18  10.10
Female  90.10   3.74   9.42

=== Fresno, CA ===
        White  Black  Other
Male    79.53   6.69  17.37
Female  79.46   6.86  17.34

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    88.58   9.47   4.94
Female  89.32   8.48   5.21

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    66.58  29.33   6.92
Female  64.60  31.64   6.75

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    81.12  17.29   3.89
Female  79.96  18.47   3.87

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    81.33  13.96   7.89
Female  81.95  13.59   7.73

=== Hartford-West Hartford-East Hartford, CT ===
        White  Black  Other
Male    79.72  14.85   8.44
Female  79.65  15.40   8.04

=== Houston-The Woodlands-Sugar Land, TX ===
        White  Black  Other
Male    72.14  18.96  11.23
Female  70.01  20.87  11.46

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    79.05  17.63   6.19
Female  78.17  18.77   5.97

=== Jacksonville, FL ===
        White  Black  Other
Male    73.29  23.15   6.89
Female  71.56  24.58   7.11

=== Kansas City, MO-KS ===
        White  Black  Other
Male    83.23  14.11   6.11
Female  82.65  14.69   6.10

=== Knoxville, TN ===
        White  Black  Other
Male    91.65   7.07   3.64
Female  91.68   7.03   3.59

=== Lakeland-Winter Haven, FL ===
        White  Black  Other
Male    80.04  18.60   4.20
Female  79.65  18.87   4.35

=== Las Vegas-Henderson-Paradise, NV ===
        White  Black  Other
Male    73.10  15.78  17.33
Female  70.38  16.46  19.47

=== Little Rock-North Little Rock-Conway, AR ===
        White  Black  Other
Male    73.87  24.64   3.96
Female  71.38  26.96   4.07

=== Los Angeles-Long Beach-Anaheim, CA ===
        White  Black  Other
Male    73.67   8.19  21.98
Female  71.77   8.60  23.46

=== Louisville/Jefferson County, KY-IN ===
        White  Black  Other
Male    82.33  16.42   4.07
Female  81.47  17.31   4.03

=== Madison, WI ===
        White  Black  Other
Male    88.62   6.66   7.69
Female  88.79   6.48   7.73

=== McAllen-Edinburg-Mission, TX ===
        White  Black  Other
Male    96.95   1.39   2.25
Female  97.29   1.07   2.18

=== Memphis, TN-MS-AR ===
        White  Black  Other
Male    50.52  47.37   4.03
Female  47.15  50.85   3.92

=== Miami-Fort Lauderdale-West Palm Beach, FL ===
        White  Black  Other
Male    74.68  22.88   4.48
Female  73.55  23.91   4.59

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    78.57  17.45   6.80
Female  76.88  19.21   6.77

=== Minneapolis-St. Paul-Bloomington, MN-WI ===
        White  Black  Other
Male    81.36  11.88  10.22
Female  81.35  11.63  10.47

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    81.34  15.99   5.38
Female  80.22  17.13   5.40

=== New Haven-Milford, CT ===
        White  Black  Other
Male    78.39  17.57   7.12
Female  77.45  18.48   7.15

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    56.54  39.95   5.65
Female  53.22  43.47   5.48

=== New York-Newark-Jersey City, NY-NJ-PA ===
        White  Black  Other
Male    66.76  20.54  15.65
Female  65.02  22.18  15.79

=== North Port-Sarasota-Bradenton, FL ===
        White  Black  Other
Male    90.31   7.87   3.86
Female  90.09   7.82   4.08

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    94.50   2.69   6.19
Female  94.47   2.23   6.61

=== Oklahoma City, OK ===
        White  Black  Other
Male    80.04  12.97  13.28
Female  79.38  13.25  13.82

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    87.07   9.67   6.44
Female  86.87   9.79   6.55

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    75.79  20.02   7.33
Female  74.81  20.69   7.61

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    87.13   3.58  13.50
Female  86.62   3.16  14.43

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    85.69  12.53   5.12
Female  84.83  12.82   5.74

=== Philadelphia-Camden-Wilmington, PA-NJ-DE-MD ===
        White  Black  Other
Male    70.87  23.04   9.08
Female  69.03  24.90   9.09

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    84.66   8.40  10.59
Female  84.58   8.18  10.94

=== Pittsburgh, PA ===
        White  Black  Other
Male    88.47   9.85   4.11
Female  88.18  10.29   3.93

=== Portland-Vancouver-Hillsboro, OR-WA ===
        White  Black  Other
Male    86.46   5.24  13.61
Female  86.15   4.73  14.42

=== Providence-Warwick, RI-MA ===
        White  Black  Other
Male    86.35  10.66   6.17
Female  86.69  10.22   6.21

=== Provo-Orem, UT ===
        White  Black  Other
Male    94.97   1.72   6.90
Female  94.98   1.57   6.92

=== Raleigh, NC ===
        White  Black  Other
Male    71.66  21.21  10.17
Female  70.08  23.18   9.89

=== Richmond, VA ===
        White  Black  Other
Male    65.79  30.19   7.09
Female  63.49  32.61   6.99

=== Riverside-San Bernardino-Ontario, CA ===
        White  Black  Other
Male    80.62   9.84  13.74
Female  79.66  10.04  14.53

=== Rochester, NY ===
        White  Black  Other
Male    83.99  13.90   5.03
Female  83.04  14.79   5.05

=== Sacramento--Roseville--Arden-Arcade, CA ===
        White  Black  Other
Male    73.58   10.3  23.27
Female  72.78   10.2  24.13

=== Salt Lake City, UT ===
        White  Black  Other
Male    89.65   3.44  10.25
Female  89.75   2.96  10.65

=== San Antonio-New Braunfels, TX ===
        White  Black  Other
Male    86.79   9.63   6.45
Female  86.86   9.23   6.79

=== San Diego-Carlsbad, CA ===
        White  Black  Other
Male    79.16   7.47  18.85
Female  78.32   6.68  20.50

=== San Francisco-Oakland-Hayward, CA ===
        White  Black  Other
Male    61.62   9.29  35.07
Female  59.15   9.43  37.43

=== San Jose-Sunnyvale-Santa Clara, CA ===
        White  Black  Other
Male    55.53   3.94  45.33
Female  54.50   3.66  46.54

=== Seattle-Tacoma-Bellevue, WA ===
        White  Black  Other
Male    73.57   9.42  23.86
Female  72.90   8.68  25.35

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    92.25   4.08   8.64
Female  92.59   3.36   9.05

=== Springfield, MA ===
        White  Black  Other
Male    84.56  13.75   5.17
Female  84.35  13.65   5.35

=== St. Louis, MO-IL ===
        White  Black  Other
Male    79.30  18.49   4.79
Female  77.06  20.65   4.80

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    68.59   9.94  27.77
Female  67.91  10.17  28.34

=== Syracuse, NY ===
        White  Black  Other
Male    86.71  11.05    5.5
Female  86.17  11.37    5.6

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    81.85  14.97   6.25
Female  81.11  15.46   6.46

=== Toledo, OH ===
        White  Black  Other
Male    82.74  17.14   3.69
Female  81.68  18.15   3.71

=== Tucson, AZ ===
        White  Black  Other
Male    86.89   6.22  10.57
Female  87.27   5.33  10.98

=== Tulsa, OK ===
        White  Black  Other
Male    78.81  10.28  18.52
Female  78.34  10.67  18.69

=== Urban Honolulu, HI ===
        White  Black  Other
Male    40.90   4.85  87.08
Female  35.97   3.46  92.56

=== Virginia Beach-Norfolk-Newport News, VA-NC ===
        White  Black  Other
Male    64.39  32.57   7.63
Female  61.29  35.17   8.11

=== Washington-Arlington-Alexandria, DC-VA-MD-WV ===
        White  Black  Other
Male     61.8  27.59  14.79
Female   59.1  29.65  15.47

=== Wichita, KS ===
        White  Black  Other
Male    86.54  10.11   7.49
Female  86.40   9.91   7.97

=== Winston-Salem, NC ===
        White  Black  Other
Male    78.16  19.86   4.49
Female  76.39  21.57   4.55

=== Worcester, MA-CT ===
        White  Black  Other
Male    86.67   8.56   7.51
Female  86.91   8.17   7.62

# Employment

In [142]:
ind_1980 = pd.read_csv("../../data/1980.annual_all_industries.csv").drop(
    columns=["own_code", "industry_code", "qtr"]
)
ind_1980["area_fips"] = pd.to_numeric(ind_1980["area_fips"], errors="coerce")
ind_1980

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_27336/2049274693.py:1: DtypeWarning: Columns (7,28) have mixed types. Specify dtype option on import or set low_memory=False.
  ind_1980 = pd.read_csv("../../data/1980.annual_all_industries.csv").drop(

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,NaN,10,0,1980,NaN,U.S. TOTAL,Total Covered,"Total, all industries","National, Total Covered",All establishment sizes,...,113697731700,9.7,13949398900,3.2,-1019358800,-8.7,24,9.5,1223,9.3
1,1000.0,50,0,1980,NaN,Alabama -- Statewide,Total Covered,"Total, all industries","State, Total Covered",All establishment sizes,...,1325526818,8.4,85412906,1.3,-31146277,-18.1,21,9.3,1049,8.8
2,1001.0,70,0,1980,NaN,"Autauga County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,4264024,4.0,0,0.0,0,0.0,29,12.1,1480,11.9
3,1003.0,70,0,1980,NaN,"Baldwin County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,10551632,6.4,0,0.0,0,0.0,15,8.5,819,8.9
4,1005.0,70,0,1980,NaN,"Barbour County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,4377310,7.0,0,0.0,0,0.0,13,7.1,658,6.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17131,NaN,41,0,1980,NaN,"Worcester-Fitchburg-Leominster, Ma NECMA",Private,"Total, all industries","MSA, Total -- by ownership sector",All establishment sizes,...,233801783,8.8,0,0.0,0,0.0,21,9.3,1104,9.4
17132,NaN,41,0,1980,NaN,"Yakima, Wa MSA",Private,"Total, all industries","MSA, Total -- by ownership sector",All establishment sizes,...,41602046,7.5,0,0.0,0,0.0,10,4.8,529,4.9
17133,NaN,41,0,1980,NaN,"York, Pa MSA",Private,"Total, all industries","MSA, Total -- by ownership sector",All establishment sizes,...,165443779,10.0,0,0.0,0,0.0,22,9.5,1163,9.6
17134,NaN,41,0,1980,NaN,"Youngstown-Warren, Oh MSA",Private,"Total, all industries","MSA, Total -- by ownership sector",All establishment sizes,...,4206458,0.2,0,0.0,0,0.0,18,6.2,964,6.4
17135,NaN,41,0,1980,NaN,"Yuba City, Ca MSA",Private,"Total, all industries","MSA, Total -- by ownership sector",All establishment sizes,...,28449706,10.7,0,0.0,0,0.0,17,8.3,876,8.2

In [143]:
ind_2022 = pd.read_csv("../../data/2022.annual_all_industries.csv").drop(
    columns=["own_code", "industry_code", "qtr"]
)
ind_2022["area_fips"] = pd.to_numeric(ind_2022["area_fips"], errors="coerce")
ind_2022

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_27336/2839077311.py:1: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  ind_2022 = pd.read_csv("../../data/2022.annual_all_industries.csv").drop(

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,1000.0,50,0,2022,NaN,Alabama -- Statewide,Total Covered,"10 Total, all industries","State, Total Covered",All establishment sizes,...,9290719237,8.7,841800853,5.1,-48478330,-18.1,57,5.5,2951,5.4
1,1000.0,51,0,2022,NaN,Alabama -- Statewide,Federal Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,121139973,2.5,0,0.0,0,0.0,52,3.0,2691,3.0
2,1000.0,51,0,2022,NaN,Alabama -- Statewide,State Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,341991292,5.9,-15729,-3.6,-2004,-37.4,66,5.8,3478,5.8
3,1000.0,51,0,2022,NaN,Alabama -- Statewide,Local Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,701098314,7.0,4756021,3.5,-546597,-30.6,46,5.0,2390,5.0
4,1000.0,51,0,2022,NaN,Alabama -- Statewide,Private,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,8126489658,9.4,837060561,5.1,-47929729,-18.0,59,5.7,3046,5.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19251,NaN,95,0,2022,NaN,U.S. TOTAL,Total Government,"10 Total, all industries",Total Government (U.S.),All establishment sizes,...,72190158731,5.3,2179138215,6.1,-51842769,-21.4,51,4.1,2641,4.1
19252,NaN,94,0,2022,NaN,U.S. TOTAL,Total U.I. Covered (Excludes Federal Government),"10 Total, all industries",Total U.I. Covered (U.S.),All establishment sizes,...,770328815924,8.1,162185375499,8.8,127404523,0.4,45,3.5,2375,3.5
19253,NaN,92,0,2022,NaN,U.S. Combined Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. CMSAs or all U.S. CSAs",All establishment sizes,...,535181314882,7.0,120077517928,8.5,51424249,0.2,39,2.9,2017,2.9
19254,NaN,91,0,2022,NaN,U.S. Metropolitan Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. MSAs",All establishment sizes,...,616603104921,7.2,132306819289,8.5,-51626434,-0.2,41,3.1,2089,3.0
19255,NaN,93,0,2022,NaN,U.S. Nonmetropolitan Area Counties (combined),Total Covered,"10 Total, all industries","Total, all U.S. non-MSA counties",All establishment sizes,...,162171651391,14.2,29878556210,10.8,179030957,3.8,84,7.6,4340,7.6

In [144]:
all_ind = pd.concat([ind_1980, ind_2022])
all_ind

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,NaN,10,0,1980,NaN,U.S. TOTAL,Total Covered,"Total, all industries","National, Total Covered",All establishment sizes,...,113697731700,9.7,13949398900,3.2,-1019358800,-8.7,24,9.5,1223,9.3
1,1000.0,50,0,1980,NaN,Alabama -- Statewide,Total Covered,"Total, all industries","State, Total Covered",All establishment sizes,...,1325526818,8.4,85412906,1.3,-31146277,-18.1,21,9.3,1049,8.8
2,1001.0,70,0,1980,NaN,"Autauga County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,4264024,4.0,0,0.0,0,0.0,29,12.1,1480,11.9
3,1003.0,70,0,1980,NaN,"Baldwin County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,10551632,6.4,0,0.0,0,0.0,15,8.5,819,8.9
4,1005.0,70,0,1980,NaN,"Barbour County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,4377310,7.0,0,0.0,0,0.0,13,7.1,658,6.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19251,NaN,95,0,2022,NaN,U.S. TOTAL,Total Government,"10 Total, all industries",Total Government (U.S.),All establishment sizes,...,72190158731,5.3,2179138215,6.1,-51842769,-21.4,51,4.1,2641,4.1
19252,NaN,94,0,2022,NaN,U.S. TOTAL,Total U.I. Covered (Excludes Federal Government),"10 Total, all industries",Total U.I. Covered (U.S.),All establishment sizes,...,770328815924,8.1,162185375499,8.8,127404523,0.4,45,3.5,2375,3.5
19253,NaN,92,0,2022,NaN,U.S. Combined Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. CMSAs or all U.S. CSAs",All establishment sizes,...,535181314882,7.0,120077517928,8.5,51424249,0.2,39,2.9,2017,2.9
19254,NaN,91,0,2022,NaN,U.S. Metropolitan Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. MSAs",All establishment sizes,...,616603104921,7.2,132306819289,8.5,-51626434,-0.2,41,3.1,2089,3.0
19255,NaN,93,0,2022,NaN,U.S. Nonmetropolitan Area Counties (combined),Total Covered,"10 Total, all industries","Total, all U.S. non-MSA counties",All establishment sizes,...,162171651391,14.2,29878556210,10.8,179030957,3.8,84,7.6,4340,7.6

In [145]:
# add msa codes to each county
msa_all_ind = all_ind.merge(
    msa_county[["ssacounty", "fipscounty", "cbsaname"]],
    left_on="area_fips",
    right_on="fipscounty",
    how="inner",
).drop(columns=["fipscounty"])
msa_all_ind

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg,ssacounty,cbsaname
0,1001.0,70,0,1980,NaN,"Autauga County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,0,0.0,0,0.0,29,12.1,1480,11.9,1000,"Montgomery, AL"
1,1003.0,70,0,1980,NaN,"Baldwin County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,0,0.0,0,0.0,15,8.5,819,8.9,1010,NaN
2,1005.0,70,0,1980,NaN,"Barbour County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,0,0.0,0,0.0,13,7.1,658,6.9,1020,NaN
3,1007.0,70,0,1980,NaN,"Bibb County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,0,0.0,0,0.0,17,10.6,868,10.4,1030,"Birmingham-Hoover, AL"
4,1009.0,70,0,1980,NaN,"Blount County, Alabama",Total Covered,"Total, all industries","County, Total Covered",All establishment sizes,...,0,0.0,0,0.0,27,14.3,1396,14.2,1040,"Birmingham-Hoover, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
31321,72153.0,70,0,2022,NaN,"Yauco Municipio, Puerto Rico",Total Covered,"10 Total, all industries","County, Total Covered",All establishment sizes,...,3752667,11.1,187995,23.3,35,8.2,1848,8.3,40770,"Yauco, PR"
31322,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",Federal Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,0,0.0,0,0.0,-7,-0.6,-382,-0.6,40770,"Yauco, PR"
31323,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",State Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,0,0.0,0,0.0,0,0.0,0,0.0,40770,"Yauco, PR"
31324,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",Local Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,0,0.0,0,0.0,0,0.0,0,0.0,40770,"Yauco, PR"
31325,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",Private,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,3752667,11.1,187995,23.3,36,8.7,1888,8.8,40770,"Yauco, PR"

In [146]:
# keep only rows relevant to bfi dataset
merged_all_ind = msa_all_ind.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="ssacounty",
    right_on="metro13",
    how="inner",
).drop(columns=["ssacounty", "cbsaname", "area_fips", "industry_title"])
merged_all_ind

,agglvl_code,size_code,year,disclosure_code,area_title,own_title,agglvl_title,size_title,annual_avg_estabs_count,annual_avg_emplvl,...,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg,metro13,metro_title
0,70,0,1980,NaN,"Martin County, Florida",Total Covered,"County, Total Covered",All establishment sizes,1792,21380,...,0,0.0,0,0.0,40,19.5,2087,19.5,10420,"Akron, OH"
1,70,0,1980,NaN,"Seminole County, Florida",Total Covered,"County, Total Covered",All establishment sizes,3199,44771,...,0,0.0,0,0.0,21,10.6,1079,10.4,10580,"Albany-Schenectady-Troy, NY"
2,70,0,1980,NaN,"Iroquois County, Illinois",Total Covered,"County, Total Covered",All establishment sizes,647,7132,...,0,0.0,0,0.0,20,10.5,1048,10.6,14460,"Boston-Cambridge-Newton, MA-NH"
3,70,0,1980,NaN,"Putnam County, Illinois",Total Covered,"County, Total Covered",All establishment sizes,127,1748,...,0,0.0,0,0.0,25,7.2,1298,7.2,14860,"Bridgeport-Stamford-Norwalk, CT"
4,70,0,1980,NaN,"Jefferson County, Indiana",Total Covered,"County, Total Covered",All establishment sizes,615,10431,...,0,0.0,0,0.0,26,11.7,1320,11.3,15380,"Buffalo-Cheektowaga-Niagara Falls, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
472,70,0,2022,NaN,"Juncos Municipio, Puerto Rico",Total Covered,"County, Total Covered",All establishment sizes,270,8266,...,3450155,6.8,47933,5.4,11,1.1,603,1.1,40380,"Rochester, NY"
473,71,0,2022,NaN,"Juncos Municipio, Puerto Rico",Federal Government,"County, Total -- by ownership sector",All establishment sizes,2,31,...,0,0.0,0,0.0,118,9.2,6161,9.2,40380,"Rochester, NY"
474,71,0,2022,NaN,"Juncos Municipio, Puerto Rico",State Government,"County, Total -- by ownership sector",All establishment sizes,10,512,...,0,0.0,0,0.0,0,0.0,0,0.0,40380,"Rochester, NY"
475,71,0,2022,NaN,"Juncos Municipio, Puerto Rico",Local Government,"County, Total -- by ownership sector",All establishment sizes,1,690,...,0,0.0,0,0.0,0,0.0,0,0.0,40380,"Rochester, NY"
476,71,0,2022,NaN,"Juncos Municipio, Puerto Rico",Private,"County, Total -- by ownership sector",All establishment sizes,257,7034,...,3456165,6.8,48198,5.4,2,0.2,114,0.2,40380,"Rochester, NY"

In [147]:
merged_all_ind.columns

Index(['agglvl_code', 'size_code', 'year', 'disclosure_code', 'area_title',
       'own_title', 'agglvl_title', 'size_title', 'annual_avg_estabs_count',
       'annual_avg_emplvl', 'total_annual_wages', 'taxable_annual_wages',
       'annual_contributions', 'annual_avg_wkly_wage', 'avg_annual_pay',
       'lq_disclosure_code', 'lq_annual_avg_estabs_count',
       'lq_annual_avg_emplvl', 'lq_total_annual_wages',
       'lq_taxable_annual_wages', 'lq_annual_contributions',
       'lq_annual_avg_wkly_wage', 'lq_avg_annual_pay', 'oty_disclosure_code',
       'oty_annual_avg_estabs_count_chg',
       'oty_annual_avg_estabs_count_pct_chg', 'oty_annual_avg_emplvl_chg',
       'oty_annual_avg_emplvl_pct_chg', 'oty_total_annual_wages_chg',
       'oty_total_annual_wages_pct_chg', 'oty_taxable_annual_wages_chg',
       'oty_taxable_annual_wages_pct_chg', 'oty_annual_contributions_chg',
       'oty_annual_contributions_pct_chg', 'oty_annual_avg_wkly_wage_chg',
       'oty_annual_avg_wkly_wage_pct_chg', 'oty_avg_annual_pay_chg',
       'oty_avg_annual_pay_pct_chg', 'metro13', 'metro_title'],
      dtype='object')

In [148]:
cols = [
    "metro13",
    "metro_title",
    "year",
    "annual_avg_estabs_count",
    "annual_avg_emplvl",
    "total_annual_wages",
    "annual_avg_wkly_wage",
]

agg_df = merged_all_ind.groupby(["metro13", "metro_title", "year"], as_index=False).agg(
    {
        "annual_avg_estabs_count": "sum",
        "annual_avg_emplvl": "sum",
        "total_annual_wages": "sum",
        "annual_avg_wkly_wage": "mean",
    }
)


msa_tables = {}

for msa, sub in agg_df.groupby("metro_title"):
    table = sub.set_index("year")[
        [
            "annual_avg_estabs_count",
            "annual_avg_emplvl",
            "total_annual_wages",
            "annual_avg_wkly_wage",
        ]
    ].T

    table.index = [
        "Average Establishments",
        "Average Employment (Jobs)",
        "Total Annual Wages ($)",
        "Average Weekly Wage ($)",
    ]

    if len(sub["year"].unique()) > 1:
        years = sorted(sub["year"].unique())
        y0, y1 = years[0], years[-1]
        table["% Change"] = ((table[y1] - table[y0]) / table[y0] * 100).round(2)

    msa_tables[msa] = table.round(2)


for msa, table in msa_tables.items():
    print(f"=== {msa} ===")
    display(table)

=== Akron, OH ===

year                              1980          2022  % Change
Average Establishments          3584.0  1.449000e+04    304.30
Average Employment (Jobs)      42760.0  1.461490e+05    241.79
Total Annual Wages ($)     546945976.0  8.009316e+09   1364.37
Average Weekly Wage ($)          253.0  1.085800e+03    329.17

=== Albany-Schenectady-Troy, NY ===

year                               1980          2022  % Change
Average Establishments     6.398000e+03  3.532600e+04    452.14
Average Employment (Jobs)  8.954200e+04  4.165220e+05    365.17
Total Annual Wages ($)     1.024799e+09  2.504836e+10   2344.22
Average Weekly Wage ($)    2.516000e+02  1.131000e+03    349.52

=== Boston-Cambridge-Newton, MA-NH ===

year                               1980         2022  % Change
Average Establishments     1.294000e+03       1370.0      5.87
Average Employment (Jobs)  1.426400e+04      14006.0     -1.81
Total Annual Wages ($)     1.559466e+08  623245328.0    299.65
Average Weekly Wage ($)    2.202500e+02        867.5    293.87

=== Bridgeport-Stamford-Norwalk, CT ===

year                             1980         2022  % Change
Average Establishments          254.0        332.0     30.71
Average Employment (Jobs)      3496.0       3474.0     -0.63
Total Annual Wages ($)     67979302.0  217178146.0    219.48
Average Weekly Wage ($)         297.0       1042.0    250.84

=== Buffalo-Cheektowaga-Niagara Falls, NY ===

year                              1980          2022  % Change
Average Establishments          1230.0  1.421000e+03     15.53
Average Employment (Jobs)      20862.0  2.503200e+04     19.99
Total Annual Wages ($)     270375940.0  1.195968e+09    342.34
Average Weekly Wage ($)          266.6  9.596000e+02    259.94

=== Charleston-North Charleston, SC ===

year                             1980         2022  % Change
Average Establishments         1212.0       1242.0      2.48
Average Employment (Jobs)      9278.0      12816.0     38.13
Total Annual Wages ($)     92594982.0  577843824.0    524.06
Average Weekly Wage ($)         218.8        915.4    318.37

=== Charlotte-Concord-Gastonia, NC-SC ===

year                              1980          2022  % Change
Average Establishments          1370.0  1.740000e+03     27.01
Average Employment (Jobs)      11936.0  2.342000e+04     96.21
Total Annual Wages ($)     127752922.0  1.334287e+09    944.43
Average Weekly Wage ($)          222.0  1.119400e+03    404.23

=== Chicago-Naperville-Elgin, IL-IN-WI ===

year                              1980         2022  % Change
Average Establishments          1092.0        964.0    -11.72
Average Employment (Jobs)      10102.0      11428.0     13.13
Total Annual Wages ($)     106452604.0  599705894.0    463.35
Average Weekly Wage ($)          229.6       1093.2    376.13

=== Cincinnati, OH-KY-IN ===

year                             1980         2022  % Change
Average Establishments          872.0        595.0    -31.77
Average Employment (Jobs)      8158.0       6286.0    -22.95
Total Annual Wages ($)     82969676.0  236010608.0    184.45
Average Weekly Wage ($)         218.8        782.6    257.68

=== Colorado Springs, CO ===

year                             1980        2022  % Change
Average Establishments          356.0       222.0    -37.64
Average Employment (Jobs)      2362.0      2115.0    -10.46
Total Annual Wages ($)     25139680.0  82632208.0    228.69
Average Weekly Wage ($)         211.8       769.2    263.17

=== Columbia, SC ===

year                             1980         2022  % Change
Average Establishments          646.0        526.0    -18.58
Average Employment (Jobs)      5412.0       4677.0    -13.58
Total Annual Wages ($)     55347836.0  189800186.0    242.92
Average Weekly Wage ($)         221.8        911.0    310.73

=== Columbus, OH ===

year                             1980          2022  % Change
Average Establishments          688.0  3.090000e+03    349.13
Average Employment (Jobs)      9114.0  5.819700e+04    538.55
Total Annual Wages ($)     97808266.0  2.967811e+09   2934.32
Average Weekly Wage ($)         218.4  9.896000e+02    353.11

=== Dallas-Fort Worth-Arlington, TX ===

year                             1980         2022  % Change
Average Establishments          366.0        442.0     20.77
Average Employment (Jobs)      4152.0       4340.0      4.53
Total Annual Wages ($)     39077990.0  168025610.0    329.98
Average Weekly Wage ($)         190.0        832.6    338.21

=== Dayton, OH ===

year                              1980         2022  % Change
Average Establishments           674.0       1004.0     48.96
Average Employment (Jobs)       9642.0      10502.0      8.92
Total Annual Wages ($)     129912738.0  505964378.0    289.46
Average Weekly Wage ($)          258.8        958.4    270.32

=== Fresno, CA ===

year                              1980         2022  % Change
Average Establishments          182.00        368.0    102.20
Average Employment (Jobs)      1576.00       3586.0    127.54
Total Annual Wages ($)     15107088.00  154280812.0    921.25
Average Weekly Wage ($)         207.75        941.4    353.14

=== Grand Rapids-Wyoming, MI ===

year                             1980         2022  % Change
Average Establishments          438.0        384.0    -12.33
Average Employment (Jobs)      2670.0       2892.0      8.31
Total Annual Wages ($)     25964780.0  131305322.0    405.71
Average Weekly Wage ($)         149.2       1005.0    573.59

=== Greensboro-High Point, NC ===

year                             1980         2022  % Change
Average Establishments          547.0        650.0     18.83
Average Employment (Jobs)      5401.0       7200.0     33.31
Total Annual Wages ($)     56008409.0  353829550.0    531.74
Average Weekly Wage ($)         151.0        965.2    539.21

=== Greenville-Anderson-Mauldin, SC ===

year                              1980         2022  % Change
Average Establishments          756.00        748.0     -1.06
Average Employment (Jobs)      7090.00       7420.0      4.65
Total Annual Wages ($)     68270610.00  329844886.0    383.14
Average Weekly Wage ($)         212.75        919.4    332.15

=== Harrisburg-Carlisle, PA ===

year                              1980          2022  % Change
Average Establishments          1142.0  1.692000e+03     48.16
Average Employment (Jobs)      15148.0  2.573900e+04     69.92
Total Annual Wages ($)     168245634.0  1.109275e+09    559.32
Average Weekly Wage ($)          232.6  8.944000e+02    284.52

=== Hartford-West Hartford-East Hartford, CT ===

year                              1980         2022  % Change
Average Establishments           940.0       1876.0     99.57
Average Employment (Jobs)      11990.0      21822.0     82.00
Total Annual Wages ($)     114572142.0  853262580.0    644.74
Average Weekly Wage ($)          213.4        865.8    305.72

=== Indianapolis-Carmel-Anderson, IN ===

year                             1980         2022  % Change
Average Establishments          416.0       1346.0    223.56
Average Employment (Jobs)      3608.0       5671.0     57.18
Total Annual Wages ($)     31305016.0  160809414.0    413.69
Average Weekly Wage ($)         198.8        749.0    276.76

=== Jacksonville, FL ===

year                              1980         2022  % Change
Average Establishments          1006.0       1734.0     72.37
Average Employment (Jobs)       9638.0      11968.0     24.18
Total Annual Wages ($)     128621706.0  518249276.0    302.93
Average Weekly Wage ($)          251.6       1038.8    312.88

=== Kansas City, MO-KS ===

year                             1980         2022  % Change
Average Establishments          324.0        468.0     44.44
Average Employment (Jobs)      3010.0       3592.0     19.34
Total Annual Wages ($)     29812424.0  167184262.0    460.79
Average Weekly Wage ($)         212.8        876.2    311.75

=== Milwaukee-Waukesha-West Allis, WI ===

year                              1980         2022  % Change
Average Establishments           812.0       1210.0     49.01
Average Employment (Jobs)       8942.0      13258.0     48.27
Total Annual Wages ($)     112508185.0  657047716.0    484.00
Average Weekly Wage ($)          155.0       1157.4    646.71

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===

year                             1980         2022  % Change
Average Establishments          728.0       1532.0    110.44
Average Employment (Jobs)     10232.0      20008.0     95.54
Total Annual Wages ($)     96382564.0  867804868.0    800.38
Average Weekly Wage ($)         212.4        970.2    356.78

=== New Haven-Milford, CT ===

year                             1980         2022  % Change
Average Establishments          510.0       1004.0     96.86
Average Employment (Jobs)      3808.0      10138.0    166.23
Total Annual Wages ($)     37693404.0  744145362.0   1874.21
Average Weekly Wage ($)         200.8       1366.4    580.48

=== New Orleans-Metairie, LA ===

year                              1980         2022  % Change
Average Establishments          1076.0       1335.0     24.07
Average Employment (Jobs)      10742.0      15412.0     43.47
Total Annual Wages ($)     119929636.0  778580064.0    549.20
Average Weekly Wage ($)          232.0        945.2    307.41

=== Ogden-Clearfield, UT ===

year                              1980          2022  % Change
Average Establishments          1808.0  2.226000e+03     23.12
Average Employment (Jobs)      26212.0  3.564900e+04     36.00
Total Annual Wages ($)     342548318.0  1.932745e+09    464.23
Average Weekly Wage ($)          283.0  1.099400e+03    288.48

=== Oklahoma City, OK ===

year                              1980          2022  % Change
Average Establishments          3524.0  2.813000e+03    -20.18
Average Employment (Jobs)      57012.0  4.161500e+04    -27.01
Total Annual Wages ($)     903433228.0  1.944651e+09    115.25
Average Weekly Wage ($)          290.6  1.011200e+03    247.97

=== Omaha-Council Bluffs, NE-IA ===

year                              1980         2022  % Change
Average Establishments           780.0        737.0     -5.51
Average Employment (Jobs)       9922.0       6971.0    -29.74
Total Annual Wages ($)     153670946.0  269883440.0     75.62
Average Weekly Wage ($)          268.0        861.6    221.49

=== Orlando-Kissimmee-Sanford, FL ===

year                              1980          2022  % Change
Average Establishments          2840.0  2.933000e+03      3.27
Average Employment (Jobs)      38828.0  4.816200e+04     24.04
Total Annual Wages ($)     474550448.0  2.303971e+09    385.51
Average Weekly Wage ($)          266.0  1.065400e+03    300.53

=== Oxnard-Thousand Oaks-Ventura, CA ===

year                              1980          2022  % Change
Average Establishments           880.0  1.757000e+03     99.66
Average Employment (Jobs)      14594.0  3.316400e+04    127.24
Total Annual Wages ($)     136127550.0  1.495202e+09    998.38
Average Weekly Wage ($)          200.8  9.374000e+02    366.83

=== Palm Bay-Melbourne-Titusville, FL ===

year                             1980         2022  % Change
Average Establishments          274.0        504.0     83.94
Average Employment (Jobs)      3458.0       5877.0     69.95
Total Annual Wages ($)     32699582.0  258433820.0    690.33
Average Weekly Wage ($)         197.0        864.8    338.98

=== Phoenix-Mesa-Scottsdale, AZ ===

year                              1980          2022  % Change
Average Establishments           618.0  1.740000e+03    181.55
Average Employment (Jobs)       7516.0  1.486500e+04     97.78
Total Annual Wages ($)     103578742.0  1.042971e+09    906.94
Average Weekly Wage ($)          272.4  1.359200e+03    398.97

=== Pittsburgh, PA ===

year                              1980         2022  % Change
Average Establishments          1410.0       2132.0     51.21
Average Employment (Jobs)      15040.0      20619.0     37.09
Total Annual Wages ($)     188359598.0  985683120.0    423.30
Average Weekly Wage ($)          258.2       1132.6    338.65

=== Provo-Orem, UT ===

year                             1980         2022  % Change
Average Establishments          270.0        304.0     12.59
Average Employment (Jobs)      2862.0       2742.0     -4.19
Total Annual Wages ($)     32019846.0  138467617.0    332.44
Average Weekly Wage ($)         220.6        592.6    168.63

=== Raleigh, NC ===

year                              1980          2022  % Change
Average Establishments           552.0  9.900000e+02     79.35
Average Employment (Jobs)      17070.0  3.272200e+04     91.69
Total Annual Wages ($)     233593464.0  2.641716e+09   1030.90
Average Weekly Wage ($)          270.6  1.290400e+03    376.87

=== Richmond, VA ===

year                              2022
Average Establishments           592.0
Average Employment (Jobs)      12314.0
Total Annual Wages ($)     382014112.0
Average Weekly Wage ($)          633.4

=== Riverside-San Bernardino-Ontario, CA ===

year                              2022
Average Establishments           764.0
Average Employment (Jobs)       8232.0
Total Annual Wages ($)     171263122.0
Average Weekly Wage ($)          627.0

=== Rochester, NY ===

year                              2022
Average Establishments           540.0
Average Employment (Jobs)      16533.0
Total Annual Wages ($)     897822784.0
Average Weekly Wage ($)          922.0

=== Spokane-Spokane Valley, WA ===

year                              1980         2022  % Change
Average Establishments           896.0       1405.0     56.81
Average Employment (Jobs)      14250.0      18500.0     29.82
Total Annual Wages ($)     147421836.0  762707518.0    417.36
Average Weekly Wage ($)          239.5        914.2    281.71

=== Springfield, MA ===

year                              1980         2022  % Change
Average Establishments           664.0       1114.0     67.77
Average Employment (Jobs)      11564.0      15360.0     32.83
Total Annual Wages ($)     123571774.0  634317522.0    413.32
Average Weekly Wage ($)          234.5        904.6    285.76

=== Stockton-Lodi, CA ===

year                              1980          2022  % Change
Average Establishments          1733.0  4.644000e+03    167.97
Average Employment (Jobs)      27362.0  7.796600e+04    184.94
Total Annual Wages ($)     288549826.0  3.644079e+09   1162.89
Average Weekly Wage ($)          157.0  1.041800e+03    563.57

=== Syracuse, NY ===

year                              1980          2022  % Change
Average Establishments           874.0  1.902000e+03    117.62
Average Employment (Jobs)      10292.0  2.747500e+04    166.95
Total Annual Wages ($)     117414178.0  1.614498e+09   1275.05
Average Weekly Wage ($)          240.6  1.099600e+03    357.02

=== Tampa-St. Petersburg-Clearwater, FL ===

year                             1980        2022  % Change
Average Establishments          176.0       212.0     20.45
Average Employment (Jobs)      1596.0      1578.0     -1.13
Total Annual Wages ($)     20667232.0  99840818.0    383.09
Average Weekly Wage ($)         251.4      1041.8    314.40

=== Toledo, OH ===

year                               1980          2022  % Change
Average Establishments     7.198000e+03  1.182700e+04     64.31
Average Employment (Jobs)  1.344220e+05  2.406720e+05     79.04
Total Annual Wages ($)     1.616443e+09  1.306459e+10    708.23
Average Weekly Wage ($)    2.516000e+02  1.141000e+03    353.50

=== Tucson, AZ ===

year                              1980         2022  % Change
Average Establishments           740.0       1669.0    125.54
Average Employment (Jobs)       7940.0      16396.0    106.50
Total Annual Wages ($)     112791750.0  847611536.0    651.48
Average Weekly Wage ($)          251.4       1018.4    305.09

=== Tulsa, OK ===

year                             1980         2022  % Change
Average Establishments          146.0        884.0    505.48
Average Employment (Jobs)      2114.0       5744.0    171.71
Total Annual Wages ($)     27170086.0  292401924.0    976.19
Average Weekly Wage ($)         250.2       1053.0    320.86

=== Winston-Salem, NC ===

year                            1980         2022  % Change
Average Establishments         108.0        484.0    348.15
Average Employment (Jobs)     1226.0       3426.0    179.45
Total Annual Wages ($)     9747802.0  187039190.0   1818.78
Average Weekly Wage ($)        190.2       1106.2    481.60

=== Worcester, MA-CT ===

year                              1980          2022  % Change
Average Establishments           872.0  4.375000e+03    401.72
Average Employment (Jobs)      16890.0  7.368900e+04    336.29
Total Annual Wages ($)     210032350.0  4.224983e+09   1911.59
Average Weekly Wage ($)          244.4  1.153800e+03    372.09

# Merge into large dataset with BFI

In [149]:
bfi_df1980 = bfi_df.copy()
bfi_df1980["year"] = 1980
bfi_df2022 = bfi_df.copy()
bfi_df2022["year"] = 2022
bfi_yrs = pd.concat([bfi_df1980, bfi_df2022])
print(bfi_yrs.head())
print(bfi_yrs.tail())

   metro13 metro_title  change_ln_population  not_lbfr_share_prime_change  \
0        1          AL              0.006923                     -0.01089
1        5          AR             -0.027700                     -0.02280
2        6          CA              0.360200                     -0.07647
3        8          CO              0.419600                     -0.09702
4       12          FL              0.463400                     -0.05614

   unemployed_share_prime_change  non_hc_share_prime_change  \
0                       -0.01635                  -0.020300
1                       -0.01652                  -0.009817
2                       -0.02523                   0.080720
3                       -0.01325                   0.087190
4                       -0.00591                   0.031780

   hc_emp_share_prime_change  manu_share_prime_change  \
0                    0.04754                -0.109100
1                    0.04915                -0.034590
2                    0.02098                -0.026890
3                    0.02308                 0.008112
4                    0.03028                -0.065120

   non_manu_share_prime_change  manufacturing_share_prime1980  ...  \
0                      0.13640                        0.24990  ...
1                      0.07392                        0.18920  ...
2                      0.12860                        0.07481  ...
3                      0.10220                        0.03467  ...
4                      0.12720                        0.09937  ...

   change_earnings  college1980  college2022  change_college  \
0           0.4585      0.07756       0.1600         0.08243
1           0.4778      0.07879       0.1613         0.08254
2           0.5453      0.13910       0.2361         0.09704
3           0.5516      0.15570       0.3569         0.20120
4           0.3837      0.14390       0.2902         0.14630

   healthcare_share_prime2022  healthcare_share_prime1980  \
0                     0.08564                     0.03810
1                     0.08988                     0.04074
2                     0.06424                     0.04326
3                     0.06779                     0.04471
4                     0.09054                     0.06027

   change_non_hc_share_lbfr  change_ln_non_hc  non_hc_manu_share_prime_change  \
0                  -0.05360           0.01936                        0.088800
1                  -0.05038           0.02297                        0.024760
2                  -0.02911           0.38450                        0.107610
3                  -0.02375           0.52890                        0.079078
4                  -0.03358           0.52410                        0.096890

   year
0  1980
1  1980
2  1980
3  1980
4  1980

[5 rows x 27 columns]
     metro13                                   metro_title  \
125    47260    Virginia Beach-Norfolk-Newport News, VA-NC
126    47900  Washington-Arlington-Alexandria, DC-VA-MD-WV
127    48620                                   Wichita, KS
128    49180                             Winston-Salem, NC
129    49340                              Worcester, MA-CT

     change_ln_population  not_lbfr_share_prime_change  \
125                0.3525                    -0.068140
126                0.6018                    -0.060330
127                0.3014                    -0.041580
128                0.4209                     0.003533
129                0.2309                    -0.049690

     unemployed_share_prime_change  non_hc_share_prime_change  \
125                      -0.000817                   0.031050
126                       0.002283                   0.037890
127                       0.019200                   0.006006
128                       0.004468                  -0.082680
129                       0.003451                   0.018820

     hc_emp_share_prime_change  manu_share_prime_change  \
125                    0.03791                -0.045280
126                    0.02016                -0.006818
127                    0.01637                -0.103900
128                    0.07468                -0.193400
129                    0.02742                -0.159300

     non_manu_share_prime_change  manufacturing_share_prime1980  ...  \
125                      0.11420                        0.10720  ...
126                      0.06487                        0.03223  ...
127                      0.12630                        0.24270  ...
128                      0.18540                        0.30930  ...
129                      0.20560                        0.25970  ...

     change_earnings  college1980  college2022  change_college  \
125           0.5376       0.1373       0.3181          0.1808
126           0.5548       0.2813       0.4991          0.2178
127           0.2752       0.1600       0.2932          0.1332
128           0.4411       0.1284       0.2859          0.1575
129           0.6015       0.1441       0.3408          0.1967

     healthcare_share_prime2022  healthcare_share_prime1980  \
125                     0.08881                     0.05090
126                     0.07075                     0.05059
127                     0.08197                     0.06561
128                     0.12600                     0.05134
129                     0.09974                     0.07232

     change_non_hc_share_lbfr  change_ln_non_hc  \
125                  -0.03976            0.3924
126                  -0.01901            0.6537
127                  -0.01459            0.3115
128                  -0.07418            0.3126
129                  -0.02726            0.3273

     non_hc_manu_share_prime_change  year
125                        0.076327  2022
126                        0.044705  2022
127                        0.109910  2022
128                        0.110719  2022
129                        0.178119  2022

[5 rows x 27 columns]

In [150]:
# make year column consistent
min_df_2022["year"] = 2022
for x in merged_pop_1980.columns:
    merged_pop_1980 = merged_pop_1980.rename(columns={x: x.lower()})
merged_pop_1980 = merged_pop_1980.rename(columns={"year of estimate": "year"})
for y in min_df_2022.columns:
    min_df_2022 = min_df_2022.rename(columns={y: y.lower()})

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_27336/610139006.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  min_df_2022['year'] = 2022

In [151]:
new_bfi_df = (
    bfi_yrs.merge(
        merged_pop_1980[["year", "race/sex indicator", "total population", "metro13"]],
        on=["metro13", "year"],
        how="left",
    )
    .merge(min_df_2022.drop(columns="metro_title"), on=["metro13", "year"], how="left")
    .merge(
        merged_all_ind[
            [
                "metro13",
                "year",
                "annual_avg_estabs_count",
                "annual_avg_emplvl",
                "total_annual_wages",
                "annual_avg_wkly_wage",
            ]
        ],
        on=["metro13", "year"],
        how="left",
    )
)
new_bfi_df

,metro13,metro_title,change_ln_population,not_lbfr_share_prime_change,unemployed_share_prime_change,non_hc_share_prime_change,hc_emp_share_prime_change,manu_share_prime_change,non_manu_share_prime_change,manufacturing_share_prime1980,...,wac_male,wac_female,bac_male,bac_female,other_male,other_female,annual_avg_estabs_count,annual_avg_emplvl,total_annual_wages,annual_avg_wkly_wage
0,1,AL,0.006923,-0.01089,-0.016350,-0.020300,0.04754,-0.109100,0.13640,0.24990,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5,AR,-0.027700,-0.02280,-0.016520,-0.009817,0.04915,-0.034590,0.07392,0.18920,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,6,CA,0.360200,-0.07647,-0.025230,0.080720,0.02098,-0.026890,0.12860,0.07481,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,8,CO,0.419600,-0.09702,-0.013250,0.087190,0.02308,0.008112,0.10220,0.03467,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,12,FL,0.463400,-0.05614,-0.005910,0.031780,0.03028,-0.065120,0.12720,0.09937,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8464,49340,"Worcester, MA-CT",0.230900,-0.04969,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,5054.0,10109.0,96.0,166.0,234.0,298.0,2187.0,36844.0,2.112492e+09,1103.0
8465,49340,"Worcester, MA-CT",0.230900,-0.04969,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,5054.0,10109.0,96.0,166.0,234.0,298.0,14.0,1348.0,1.252838e+08,1788.0
8466,49340,"Worcester, MA-CT",0.230900,-0.04969,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,5054.0,10109.0,96.0,166.0,234.0,298.0,17.0,593.0,2.422136e+07,786.0
8467,49340,"Worcester, MA-CT",0.230900,-0.04969,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,5054.0,10109.0,96.0,166.0,234.0,298.0,20.0,3389.0,1.765747e+08,1002.0
8468,49340,"Worcester, MA-CT",0.230900,-0.04969,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,5054.0,10109.0,96.0,166.0,234.0,298.0,2137.0,31515.0,1.786412e+09,1090.0